// #include <stdio.h>

// int main()
// {
//     char a = -1;
//     // 10000000 00000000 00000000 00000001 原
//     // 11111111 11111111 11111111 11111110 反
//     // 11111111 11111111 11111111 11111111 补
//     // 因为是char型取11111111
//     // 整型提升 - 补1（因为有符号类型 前面补0 得到的是补码 负数的补码需计算 故-1）
//     // 11111111 11111111 11111111 11111111
//     signed char b = -1;
//     // 11111111
//     // 整型提升 - 补1（因为有符号类型 前面补0 得到的是补码 负数的补码需计算 故-1）
//     // 11111111 11111111 11111111 11111111
//     unsigned char c = -1;
//     // 11111111
//     // 整型提升 - 补1（因为无符号类型 前面补0 得到的是补码 正数的补码就是本身 故255）
//     // 00000000 00000000 00000000 11111111

//     printf("a=%d,b=%d,c=%d", a, b, c);
//     //-1 -1 255
//     return 0;
// }